<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CitySeeder extends Seeder
{
    public function run(): void
    {
        $cities = [
            "دو شهرستان",
            "برخوار",
            "شهرستان شاهین شهر",
            "استان",
            "دولت آباد",
            "شاهین شهر",
            "کشور",
            "خورزوق",
            "گز",
            "گرگاب",
            "حبیب آباد",
            "میمه",
            "دستگرد",
            "محسن آباد",
            "سین",
            "کمشچه",
            "شاپور آباد",
            "علی آباد ملاعلی",
            "وزوان",
            "ازان",
            "علی آبادچی",
            "پروانه",
            "مورچه خورت",
            "موته",
            "لایبید",
            "حسن رباط",
            "لوشاب",
            "ونداده",
            "زیاد آباد",
            "خسروآباد",
            "چغاده",
            "مراوند",
            "رباط آغاکمال",
            "باغمیران",
            "بخش میمه",
            "بیدشک",
            "جهاد آباد",
            "دنبی",
            "حوزه انتخابیه",
            "دهلر",
            "سعید آباد",
            "سه",
            "شهرک صنعتی مورچه خورت",
            "علی آبادچی و پروانه",
            "قاسم آباد",
            "کلهرود",
            "محله اسلام آباد شهر خورزوق",
            "محله امامزاده نرمی دولت آباد",
            "محله دلیگان شهر خورزوق",
            "محله سیمرغ شهر خورزوق",
            "محله کربکند دولت اباد",
            "محله لودریچه دولت آباد",
            "مرغ",
            "مرغ و دنبی",
            "ناحیه صنعتی کمشچه",
        ];

        foreach ($cities as $city) {
            DB::table('cities')->insert([
                'name' => $city
            ]);
        }
    }
}
