<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class OrganSeeder extends Seeder
{
    public function run(): void
    {
        $organs = [
            // استان اصفهان
            "استانداری اصفهان",
            "شهرداری اصفهان",
            "اداره کل آموزش و پرورش استان اصفهان",
            "اداره کل ثبت احوال استان اصفهان",
            "اداره کل انتقال خون استان اصفهان",
            "اداره کل امور مالیاتی استان اصفهان",
            "اداره کل تعاون، کار و رفاه اجتماعی استان اصفهان",
            "اداره کل راه و شهرسازی استان اصفهان",
            "اداره کل منابع طبیعی و آبخیزداری استان اصفهان",
            "اداره کل فرهنگ و ارشاد اسلامی استان اصفهان",
            "سازمان نظام مهندسی ساختمان استان اصفهان",
            "سازمان جهاد کشاورزی استان اصفهان",
            "اداره کل زندان‌های استان اصفهان",
            "اداره کل بنیاد مسکن استان اصفهان",
            "اداره کل ثبت اسناد و املاک استان اصفهان",
            "دانشگاه علوم پزشکی استان اصفهان",

            // شهرستان شاهین‌شهر و میمه
            "فرمانداری شاهین‌شهر و میمه",
            "شهرداری شاهین‌شهر",
            "بنیاد مسکن شهرستان شاهین شهر و میمه",
            "شهرداری میمه",
            "اداره آموزش و پرورش شاهین‌شهر",
            "اداره ثبت احوال شاهین‌شهر",
            "اداره گاز شهرستان شاهین‌شهر و میمه",
            "اداره برق شاهین‌شهر",
            "اداره آب و فاضلاب شاهین‌شهر",
            "اداره بهزیستی شاهین‌شهر",
            "اداره تعاون، کار و رفاه اجتماعی شاهین‌شهر",
            "اداره جهاد کشاورزی شاهین‌شهر",
            "اداره پست شاهین‌شهر",
            "شبکه بهداشت و درمان شهرستان شاهین شهر و میمه",

            // شهرستان برخوار
            "فرمانداری برخوار",
            "بنیاد مسکن شهرستان برخوار",
            "شهرداری دولت‌آباد",
            "اداره آموزش و پرورش برخوار",
            "اداره ثبت احوال برخوار",
            "اداره برق دولت‌آباد",
            "اداره گاز برخوار",
            "اداره بهزیستی برخوار",
            "اداره جهاد کشاورزی برخوار",
            "اداره تعاون، کار و رفاه اجتماعی برخوار",
            "اداره پست دولت‌ آباد",
            "شبکه بهداشت و درمان شهرستان برخوار",
        ];

        foreach ($organs as $organ) {
            DB::table('organs')->insert([
                'name' => $organ
            ]);
        }
    }
}
