<?php

namespace Database\Seeders;

use App\Models\Project;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProjectSeeder extends Seeder
{
    public function run(): void
    {
        $projects = [
            ["خانه ملت","خانه ملت همراه با سفیران در 36 شهر و روستا",72],
            ["جلسه با مدیران استانی","ادارات کل که به صورت مستمر لازم هست جلسه گذاشته شود ماهیانه یک جلسه و بقیه به صورت تقریبی",120],
            ["دعوت از مسئولان کشوری","برای بازدید از حوزه انتخابیه",11],
            ["حضور در مراسمات و نمازجعه و اجتماعات",null,150],
            ["نشست با اقشار مختلف","اصناف، کشاورزان ، فرهنگیان، ورزشکاران، صنعتگران بازنشستگان، روحانیون، بانوان، بسیجیان، کارگران، نوجوانان و جوانان ، دانشگاهیان کادر درمان و سلامت نخبگان ایثارگران رانندگان فعالین رسانه و ...",30],
            ["دیدار","دیدار با علما (۱۰) ایثارگران (۱۰+۴۶) ائمه جمعه (۱۶) عبادت از بیماران (۱۰) و...",92],
            ["ملاقات مردمی",null,25],
            ["بازدید","اعم از پروژه ها (۲۵)، واحدهای صنعتی (۱۰) تولیدی (۱۰) و خدماتی (۱۰)، ادارات (۱۰)، مراکز بهداشتی درمانی و سلامت (۱۵)، مراکز نظامی و انتظامی ، اصناف (۲)، مراکز فرهنگی و تفریحی (۱۲) مسابقات (۵) مراکز علمی و آموزشی (۵) و ...",141],
            ["پذیرش و استماع مطالب دیگران","پذیرش و استماع مطالب مدیران و مسئولین محلی استانی، ملی و سایر افراد",110],
            ["حضور","حضور در جلسات ملی، استانی محلی و مراسمات و افتتاحیه ها کلنگ زنی ها و ...",11],
            ["پیگیری جلسات خانه ملت","پیگیری جلسات خانه ملت و سفیران خدمت توسط معاونین پیشرفت",240],
            ["جلسات داخلی کارکنان دفتر",null,7],
            ["جلسه با معاونین پیشرفت",null,24],
            ["جلسه روابط عمومی و فضای مجازی",null,6],
            ["جلسه با سایر کارکنان",null,5],
            ["جلسه مذاکره با مسئولین دفتر",null,24],
            ["نشست گفتگوی یاران","نشست گفتگوی یاران هر فصل در هر شهرستان",6],
        ];

        foreach ($projects as $city) {
            $project = Project::create([
                'name' => $city[0],
                'description' => $city[1],
                'required_amount' => $city[2],
                'user_id' => 1, // باید ایجاد آیدی خودکار در مدل را به طور موقط غیر فعال کنی
            ]);

            $project->group()->attach(3);
        }
    }
}
